## Pandas

Pandas is one of Python’s packages that makes importing and analyzing data much
easier. Pandas builds on packages like NumPy and matplotlib that provides a
convenient solution for data analysts. The word pandas is an acronym which is
derived from “Python and data analysis” and “panel data”.

Python pandas is well suited for different kinds of data, such as:
- Tabular data with heterogeneously-typed columns
- Ordered and unordered time series data
- Arbitrary matrix data with row and column labels
- Unlabelled data
- Statistical data sets

To install Python Pandas, type `conda install pandas`

Pandas has **three** data structures: (These data structures are built on top of Numpy array, which means they are fast.)
- Series
- DataFrame
- Panel

### pandas.Series
Series is a one-dimensional array like structure with homogeneous data. For
example, the following series is a collection of integers 10, 23, 56, . . .

In [1]:
import pandas as pd    # import the pandas and aliasing as pd
import numpy as np
data = np.array(['a','b','c','d'])
s1 = pd.Series(data)   # using series
print(s1)

0    a
1    b
2    c
3    d
dtype: object

In [2]:
data = np.array([1,2,3,4])
s2 = pd.Series(data)
print(s2)

0    1
1    2
2    3
3    4
dtype: int32

In [3]:
data = np.array([1,'b',3,'d'])   # heterogeneous type series
s3 = pd.Series(data)
print(s3)

0    1
1    b
2    3
3    d
dtype: object

In [47]:
data = np.array(['a','b','c','d'])
s = pd.Series(data, index=[100,101,102,103])   # can change index
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [57]:
s4 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
print(s4[0])

1

In [58]:
print(s4[0:3])   # access first 3 data
# or
for i in range(3):
    print(s4[i])

a    1
b    2
c    3
dtype: int64
1
2
3

In [8]:
s4[['a']]   # access using 'a'

a    1
dtype: int64

In [9]:
#retrieve multiple elements
print(s4[['a','b','c','d']])

a    1
b    2
c    3
d    4
dtype: int64

### pandas.DataFrame()
A Data frame is a two-dimensional data structure, i.e., data is aligned in a
tabular fashion in rows and columns

In [59]:
df = pd.DataFrame()
print(df)   # output as Empty DataFrame

Empty DataFrame
Columns: []
Index: []

**The DataFrame can be created using a single list or a list of lists**

In [60]:
data = [1,2,3,4,5]
df1 = pd.DataFrame(data)
print(df1)
print()
data = [['Alex',10], ['Bob',12],['Clarke',13]]
df2 = pd.DataFrame(data,columns=['Name','Age'])
print(df2)

   0
0  1
1  2
2  3
3  4
4  5

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

**Create a DataFrame from Dict of ndarrays / Lists**  
All the ndarrays must be of same length. If index is passed, then the length of
the index should be equal to the length of the arrays.

In [62]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

**Create a DataFrame from Dict of Series**  
Dictionary of Series can be also passed to form a DataFrame.

In [61]:
d = {
    'one' : pd.Series([1,2,3], index=['a','b','c']),
    'two' : pd.Series([1,2,3,4], index=['a','b','c','d'])
}
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

<img src="table.png">

In [74]:
# turn the table into data frame
data_s = {
    'Math' : pd.Series([90,10,34,23,43]),
    'C_programming' : pd.Series([70,20,25,32,73]),
    'Java' : pd.Series([50,41,67,34,23]),
    'Web_programming' : pd.Series([55,66,23,76,67])
}
studentDF = pd.DataFrame(data_s)
print(studentDF)

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67

In [65]:
df = studentDF
print(df)
print()

print(df[2:4]) #slice rows (index: 2-3)
print()

print(df.loc[0]) #print selected row (row=0)
print()

print(df.loc[2:4])  # slice rows (index: 2-4) -> different from df[2:4]

# Note that rows can be selected by passing row label to a loc function

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   NaN            NaN   NaN              NaN
7   NaN            NaN   NaN              NaN

   Math  C_programming  Java  Web_programming
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0

Math               90.0
C_programming      70.0
Java               50.0
Web_programming    55.0
Name: 0, dtype: float64

   Math  C_programming  Java  Web_programming
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0

In [72]:
# To add new rows to a DataFrame, you can use the [append] function
df = pd.DataFrame([[1,2],[3,4]], columns = ['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]], columns = ['a','b'])

df = df.append(df2)  # add new rows
# df.index = np.array([1,2,3,4])
# or df.index = range(4)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

add new roles to studentDF
<img src="table2.png">

In [75]:
data = {
    'Math' : pd.Series([59,41], index=[5,6]),
    'C_programming' : pd.Series([37,34], index=[5,6]),
    'Java' : pd.Series([84,73], index=[5,6]),
    'Web_programming' : pd.Series([82,55], index=[5,6])
}
df = pd.DataFrame(data)
studentDF = studentDF.append(df)
print(studentDF)

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82
6    41             34    73               55

In [18]:
df = pd.DataFrame([[1,2],[3,4]], columns = ['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]], columns = ['a','b'])
df = df.append(df2)
print(df)

print()

# To delete rows, you can use index label to delete or drop rows from a DataFrame.
# If label is duplicated, then multiple rows will be dropped
# Drop rows with label 0
df = df.drop(0)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

   a  b
1  3  4
1  7  8

In [76]:
studentDF = studentDF.drop(6)    # remove last row of studentDF
print(studentDF)

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82

### Descriptive Statistics
A large number of methods collectively compute descriptive statistics and other
related operations on DataFrame. In this practice, you will explore those functions
and apply it on table studentDF.

In [77]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)
print()
df.sum()      # using sum()

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

Name    TomJackSteveRicky
Age                   133
dtype: object

In [79]:
studentDF.sum() # or studentDF.sum(axis=0)

Math               259
C_programming      257
Java               299
Web_programming    369
dtype: int64

In [23]:
studentDF.sum(axis=1)

0    265
1    137
2    149
3    165
4    206
5    262
dtype: int64

In [24]:
studentDF.count()

Math               6
C_programming      6
Java               6
Web_programming    6
dtype: int64

In [25]:
studentDF.mean()

Math               43.166667
C_programming      42.833333
Java               49.833333
Web_programming    61.500000
dtype: float64

In [26]:
studentDF.median()

Math               38.5
C_programming      34.5
Java               45.5
Web_programming    66.5
dtype: float64

In [27]:
studentDF.mode()

   Math  C_programming  Java  Web_programming
0    10             20    23               23
1    23             25    34               55
2    34             32    41               66
3    43             37    50               67
4    59             70    67               76
5    90             73    84               82

In [28]:
studentDF.std()      # standard deviation

Math               28.407159
C_programming      22.973173
Java               22.409076
Web_programming    21.002381
dtype: float64

In [29]:
studentDF.min()

Math               10
C_programming      20
Java               23
Web_programming    23
dtype: int64

In [30]:
studentDF.max()

Math               90
C_programming      73
Java               84
Web_programming    82
dtype: int64

In [31]:
studentDF.abs()     # absolute of value

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82

In [32]:
studentDF.prod()     # Product of Values

Math                1785540600
C_programming       3025120000
Java                9022246800
Web_programming    34860748560
dtype: int64

In [33]:
studentDF.cumsum()      # cumulative sum

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1   100             90    91              121
2   134            115   158              144
3   157            147   192              220
4   200            220   215              287
5   259            257   299              369

In [34]:
studentDF.cumprod()     #  Cumulative Product

         Math  C_programming        Java  Web_programming
0          90             70          50               55
1         900           1400        2050             3630
2       30600          35000      137350            83490
3      703800        1120000     4669900          6345240
4    30263400       81760000   107407700        425131080
5  1785540600     3025120000  9022246800      34860748560

In [35]:
import pandas as pd
import numpy as np

In [80]:
# create a dictionary of series
d = {
    'Name' : pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
                       'Lee','David','Gasper','Betina','Andres']),
    'Age' : pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
    'Rating' : pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,
                          4.80,4.10,3.65])
}

# create dataframe
df = pd.DataFrame(d)
df.describe()          # using describe to see all the information

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [81]:
studentDF = studentDF.reindex([0,1,2,3,4,5,6,7])   # using reindex
print(studentDF)
# NaN means ‘Not a Number’

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   NaN            NaN   NaN              NaN
7   NaN            NaN   NaN              NaN

In [87]:
df = pd.DataFrame(np.random.randn(5,3), index=['a','c','e','f','h'],    
                  columns=['one','two','three'])
df = df.reindex(['a','b','c','d','e','f','g','h'])
# random.randn(5,3) -> 2D array filled with random number (5 rows, 3 columns)

print(df['one'].isnull())   # check if it's empty
print(df['two'].notnull())  # check if it's NOT empty

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool
a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: two, dtype: bool

In [86]:
s1 = studentDF
s2 = studentDF

s1 = s1.fillna(0)    # fill missing values with 0
s2 = s2.fillna(method='pad')  # fill missing values with the last value

print(s1)
print()
print(s2)

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   0.0            0.0   0.0              0.0
7   0.0            0.0   0.0              0.0

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6  59.0           37.0  84.0             82.0
7  59.0           37.0  84.0             82.0

#### Joining/Grouping

Pandas provides join operations very similar to relational databases like SQL.
it is a single function, `merge`, as the entry point for all standard database join
operations between DataFrame objects. 

The operation `join` combines columns
from one or more tables based on their corresponding columns, e.g., ID.

In [40]:
left = pd.DataFrame({
    'id' : [1,2,3,4,5],
    'Name' : ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'subject_id' : ['sub1','sub2','sub3','sub4','sub5']
})

right = pd.DataFrame({
    'id' : [1,2,3,4,5],
    'subject_name' : ['Math','English', 'Social Science', 'Programming',
                     'Physics']
})

print(left)
print()
print(right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub3
3   4   Alice       sub4
4   5  Ayoung       sub5

   id    subject_name
0   1            Math
1   2         English
2   3  Social Science
3   4     Programming
4   5         Physics

In [88]:
merged_table = pd.merge(left, right, on='id')   # merge them based on 'id'

In [42]:
print(merged_table)

   id    Name subject_id    subject_name
0   1    Alex       sub1            Math
1   2     Amy       sub2         English
2   3   Allen       sub3  Social Science
3   4   Alice       sub4     Programming
4   5  Ayoung       sub5         Physics

<img src="table3.png">
create the 2 tables and merge them

In [43]:
first = pd.DataFrame({
    'id' : [0,1,2,3,4,5],
    'section' : ['one','one','one','two','two','two']
})

second = pd.DataFrame({
    'id' : [0,1,2,3,4,5],
    'name' : ['Mat','Mike','John','Peecha','Prabu','Bunchu'],
    'math' : [34,12,34,12,65,23],
    'english' : [23,13,51,62,12,42]
})

score = pd.merge(second, first, on='id')   # merge based on 'id'
print(score)

   id    name  math  english section
0   0     Mat    34       23     one
1   1    Mike    12       13     one
2   2    John    34       51     one
3   3  Peecha    12       62     two
4   4   Prabu    65       12     two
5   5  Bunchu    23       42     two

In [44]:
score_sec = score.groupby('section')  # group them together based on section
score_sec.sum()

         id  math  english
section
one       3    80       87
two      12   100      116

In [45]:
score_sec.describe()

        english                                                        id  \
          count       mean        std   min   25%   50%   75%   max count
section
one         3.0  29.000000  19.697716  13.0  18.0  23.0  37.0  51.0   3.0
two         3.0  38.666667  25.166115  12.0  27.0  42.0  52.0  62.0   3.0

              ...             math                                          \
        mean  ...   75%  max count       mean        std   min   25%   50%
section       ...
one      1.0  ...   1.5  2.0   3.0  26.666667  12.701706  12.0  23.0  34.0
two      4.0  ...   4.5  5.0   3.0  33.333333  27.970222  12.0  17.5  23.0


          75%   max
section
one      34.0  34.0
two      44.0  65.0

[2 rows x 24 columns]